package Day03;

import java.util.Scanner;

public class Day03_6 { // c s

	public static void main(String[] args) { // m s
		
		Scanner scanner = new Scanner(System.in);
		
//		// 별문제1 : 입력받은 수 만큼 * 출력
//		System.out.println("문제1) 별개수 : "); int s1 = scanner.nextInt();
//		for( int i =1; i<=s1; i++) {
//			// i는 1부터 입력받은 수까지 1씩 증가
//			System.out.print("*");
//		}
//		
//		// 별문제2 : 입력받은 수 만큼 * 출력 [단 5개마다 줄바꿈 처리]
//		System.out.println("문제2) 별개수 : "); int s2 = scanner.nextInt();
//		for( int i =1; i<=s2; i++) {
//			System.out.print("*");
//			// 5개마다 줄바꿈 -> 5배수 마다 -> 배수찾기
//			if(i%5==0)System.out.println(); //줄바꿈처리
//		}
//		
	//		별문제3 : 입력받은 줄 만큼 출력
	//		
	//		*				
	//		**		
	//		***		
	//		****	
	//		***** 	
	//			
		
		// i = 줄[변수] s = 별[변수]
		// i는 1부터 5까지 1씩 증가
		// s는 1부터 현재 줄수까지 1씩 증가하면서 별 출력
		
//		System.out.println("문제3) 줄 수: "); int line3 = scanner.nextInt();
//		for(int i = 1; i<=line3; i++) {
//			// i는 1부터 입력받은 줄 수 까지 1씩 증가
//			
//			// 1. 별찍기
//			for(int s = 1; s<=i; s++) {
//				System.out.print("*");
//			}
//			// 2. 줄바꿈 처리
//			System.out.println();		
//		}
			// 순서도
				// 사용자가 3을 입력했을때
				// i = 1 i<=3 [true] -> i++
					// s = 1 s<=1 [true] -> * -> s++
					// s = 2 s<=1 [false] -> 반복문 종료
				// 줄바꿈
				// i = 2 i<=3 [true]
					// s = 1 s<=2 [true] -> * -> s++
					// s = 2 s<=2 [true] -> * -> s++
					// s = 3 s<=2 [false] -> 반복문 종료
				// 줄바꿈
				// i = 3 i<=3 [true]
					// s = 1 s<=3 [true] -> * -> s++
					// s = 2 s<=3 [true] -> ** -> s++
					// s = 3 s<=3 [true] -> *** -> s++
					// s = 4 s<=3 [false] -> 반복문 종료
				// 줄바꿈
				// i = 4 i<=3 [false] 반복문 종료
					
	//					
	//	별문제4 : 입력받은 줄 만큼 출력
	//				
	//		*****	
	//		****		
	//		***				
	//		**			
	//		*				
	//			
		// i = 줄수
		
		System.out.println("줄수 : "); int line4 = scanner.nextInt();
		for(int i = 1; i<=line4; i++) {
			// i는 1부터 line4 까지 1씩 증가
			System.out.println("줄바꿈");
		}
		
		
		
		
		
	//		
	//	별문제5 : 입력받은 줄 만큼 출력
	//				
	//	        *	
	//	       **	
	//	      ***	
	//	     ****	
	//		*****	
	//
	//	별문제6 : 입력받은 줄 만큼 출력
	//		*****	
	//		 ****	
	//		  ***	
	//		   **	
	//		    *	
	//		    
	//	별문제7 : 입력받은 줄 만큼 출력
	//	        *		
	//	       ***		
	//	      *****		
	//	     *******	
	//		*********	
	//		
	//	별문제8 : 입력받은 줄만큼 출력 
	//		    1
	//	       222
	//	      33333
	//	     4444444
	//		555555555
	//		
	//	별문제9 : 입력받은 줄만큼 출력
	//
	//		*********		
	//		 *******				
	//		  *****				
	//		   ***			
	//		    *		
	//		    
	//	별문제10 : 입력받은 줄만큼 출력
	//	        *
	//	       ***
	//	      *****
	//		 *******
	//		*********
	//		 *******
	//		  *****
	//		   ***
	//		    *
	//	별문제11 : 입력받은 줄만큼 출력 [ 입력받은 행/열 동일 ] 
	//		*     *		
	//		 *   *	
	//		  * *		
	//		   *		
	//	      * *		
	//	     *   *		
	//	    *     *		
	//										
	//	별문제12 : 입력받은 줄만큼 출력
	//		*        *
	//		**      **
	//		***    ***
	//		****  ****
	//		**********
	//		****  ****
	//		***    ***
	//		**      **
	//		*        *
	//
	//	별문제13 : 입력받은 줄만큼 출력
	//		                   *                        
	//	                      * *                       
	//	                     *****                      
	//	                    *     *                     
	//	                   * *   * *                    
	//	                  ***** *****                   
	//	                 *           *                  
	//	                * *         * *                 
	//	               *****       *****                
	//	              *     *     *     *               
	//	             * *   * *   * *   * *              
	//	            ***** ***** ***** *****             
	//	           *                       *            
	//	          * *                     * *           
	//	         *****                   *****          
	//	        *     *                 *     *         
	//	       * *   * *               * *   * *        
	//	      ***** *****             ***** *****       
	//	     *           *           *           *      
	//	    * *         * *         * *         * *     
	//	   *****       *****       *****       *****    
	//	  *     *     *     *     *     *     *     *   
	//	 * *   * *   * *   * *   * *   * *   * *   * *  
	//	***** ***** ***** ***** ***** ***** ***** *****	
	//		
		
		
		
		
	} // m e
	
} // c e
